Revit 2027 API
Schema.WriteAccessGranted Method
 Checks whether Entities of this Schema may be stored by the current add-in.
Namespace: Autodesk.Revit.DB.ExtensibleStorage
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool WriteAccessGranted()
Public Function WriteAccessGranted As Boolean
public:
bool WriteAccessGranted()
member WriteAccessGranted : unit -> bool
Return Value
Boolean
 True if write access is allowed.
See Also
Reference
Schema Class
Autodesk.Revit.DB.ExtensibleStorage Namespace